### **Feature Scaling**

In [6]:
import pandas as pd

df = pd.read_csv('employee_promotion.csv')
df.head()

,Age,Salary,YearsExperience,NumCertifications,JobSatisfaction,JobTitle,Education,City,Promotion
0,28,132612,9,2,1,Data Engineer,High School,Seattle,Got Promotion
1,41,116641,8,4,3,Data Scientist,Master's,Chicago,No Promotion
2,36,113811,11,1,6,Web developer,PhD,Chicago,Got Promotion
3,32,102160,2,2,6,Data Engineer,High School,Austin,No Promotion
4,29,101313,7,4,7,Product Manager,Bachelor's,San Francisco,No Promotion

In [9]:
df_copy = df.copy()

## **Feature Scaling**

In [8]:
# 1. MinMax Scaler

In [21]:
from sklearn.preprocessing import MinMaxScaler, StandardScaler
# Imports scaling tools from sklearn.

minmax_scaler = MinMaxScaler()
# Creates a Min-Max scaler object (scales data between 0–1).

df_copy["Salary_Scaled_Normalization"] = minmax_scaler.fit_transform(df_copy[["Salary"]])
# Fits scaler on Salary column and transforms values into 0–1 range, storing results in a new column.

In [13]:
# 2. Standard Scaler

In [22]:
standard_scaler = StandardScaler()
# Creates a Standard Scaler object (scales data with mean = 0 and standard deviation = 1).

df_copy["Salary_Scaled_Standardization"] = standard_scaler.fit_transform(df_copy[["Salary"]])
# Fits on the Salary column and transforms values using (x − mean)/std, storing standardized values in a new column

## **Displaying the First Few Rows**

In [19]:
df_copy[["Salary","Salary_Scaled_Normalization","Salary_Scaled_Standardization"]].head()

   Salary  Salary_Scaled_Normalization  Salary_Scaled_Standardization
0  132612                     0.826129                       1.120060
1  116641                     0.666363                       0.572455
2  113811                     0.638053                       0.475421
3  102160                     0.521503                       0.075938
4  101313                     0.513030                       0.046897

In [20]:
df_copy[["Salary","Salary_Scaled_Normalization","Salary_Scaled_Standardization"]].describe()

,Salary,Salary_Scaled_Normalization,Salary_Scaled_Standardization
count,5000.000000,5000.000000,5.000000e+03
mean,99945.253200,0.499347,-2.192024e-16
std,29168.083473,0.291783,1.000100e+00
min,50028.000000,0.000000,-1.711537e+00
25%,74622.500000,0.246031,-8.682533e-01
50%,99449.000000,0.494383,-1.701527e-02
75%,125889.500000,0.758881,8.895628e-01
max,149993.000000,1.000000,1.716011e+00

------------------